Documents/СчетФактураВыданный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>СчетФактураВыданный</Name>
			<Comment>Счет фактура </Comment>
			<BasedOn>
				<xr:Item>Document.Акт</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Акт</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отвественный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/ОтветственныеЛица.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ОтветственныеЛица</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ГлавныйБухгалтер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Исполнитель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Кассир</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Руководитель</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/Акт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Акт</Name>
			<BasedOn>
				<xr:Item>Document.Счет</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ВзаиморасчетыПоАктам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Грузоотправитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Грузополучатель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВозвратаВБухгалтерию</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Копия</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Счет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отвественный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетФактура</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СчетФактураВыданный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Закрыт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Статусы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инвестор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Стройка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>512</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СметнаяСтоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Продукция</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодЗаказа</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>14</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Всего</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/СчетФактураВыданный/Ext/ManagerModule.bsl
// @strict-types


Процедура ПечатьСчетаФактуры(ТабДок, ПараметрКоманды) Экспорт 
	
	СчетФактура534 = Ложь;
	Если ПараметрКоманды.Дата>'20210701' Тогда
		Макет = ПолучитьМакет("СчетФактура534");
		СчетФактура534 = Истина;
	Иначе 	
		Макет = ПолучитьМакет("СчетФактура1137");
	КонецЕсли;

	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	номер = ПараметрКоманды.Номер;
	Пока Лев(Номер, 1)="0" Цикл
		Номер = Сред(Номер, 2);
	КонецЦикла;
	
	ОбластьМакета.Параметры.Номер = номер; 
	ОбластьМакета.Параметры.Дата = Формат(ПараметрКоманды.Дата, "ДФ='дд ММММ гггг'")+ " г.";
	
	Если СчетФактура534 Тогда
			ОбластьМакета.Параметры.ПредставлениеПоставщика = ПараметрКоманды.Организация.Наименование;
		ОбластьМакета.Параметры.АдресПоставщика			= ПараметрКоманды.Организация.ФактическийАдрес;
		ОбластьМакета.Параметры.ИННпоставщика           = ПараметрКоманды.Организация.ИНН + "/"
			+ ПараметрКоманды.Организация.КПП;
		Если ЗначениеЗаполнено(ПараметрКоманды.Основание.Грузоотправитель) Тогда
			ОбластьМакета.Параметры.ПредставлениеГрузоотправителя = ПараметрКоманды.Основание.Грузоотправитель;
		Иначе
			ОбластьМакета.Параметры.ПредставлениеГрузоотправителя = "Грузоотправитель и его адрес: " + "---";
		КонецЕсли;
		Если ЗначениеЗаполнено(ПараметрКоманды.Основание.Грузополучатель) Тогда
			ОбластьМакета.Параметры.ПредставлениеГрузополучателя  = ПараметрКоманды.Основание.Грузополучатель;
		Иначе
			ОбластьМакета.Параметры.ПредставлениеГрузополучателя  = ПараметрКоманды.Основание.Контрагент.НаименованиеПолное + " "
				+ ПараметрКоманды.Основание.Контрагент.ЮридическийАдрес;
		КонецЕсли;
		ОбластьМакета.Параметры.ПредставлениеПокупателя       = ПараметрКоманды.Контрагент.НаименованиеПолное;
		ОбластьМакета.Параметры.АдресПокупателя               = ПараметрКоманды.Контрагент.ЮридическийАдрес;
		ОбластьМакета.Параметры.ИННПокупателя                 = ПараметрКоманды.Контрагент.ИНН + "/"
			+ ПараметрКоманды.Контрагент.КПП;

		Попытка
			ОбластьМакета.Параметры.ДокументыОбОтгрузке = "пп " + ПараметрКоманды.Основание.Товары.Количество() + " № "
				+ ПараметрКоманды.Основание.Номер + " от " + Формат(ПараметрКоманды.Основание.Дата, "ДФ='дд ММММ гггг'")
				+ " г.";
		Исключение
			ОбластьМакета.Параметры.ДокументыОбОтгрузке = "";
		КонецПопытки;
	Иначе
		ОбластьМакета.Параметры.ПредставлениеПоставщика = "Продавец: " + ПараметрКоманды.Организация.Наименование;
		ОбластьМакета.Параметры.АдресПоставщика			= ПараметрКоманды.Организация.ФактическийАдрес;
		ОбластьМакета.Параметры.ИННпоставщика           = "ИНН/КПП продавца: " + ПараметрКоманды.Организация.ИНН + "/"
			+ ПараметрКоманды.Организация.КПП;
		Если ЗначениеЗаполнено(ПараметрКоманды.Основание.Грузоотправитель) Тогда
			ОбластьМакета.Параметры.ПредставлениеГрузоотправителя =	"Грузоотправитель и его адрес: "
				+ ПараметрКоманды.Основание.Грузоотправитель;
		Иначе
			ОбластьМакета.Параметры.ПредставлениеГрузоотправителя = "Грузоотправитель и его адрес: " + "---";
		КонецЕсли;
		Если ЗначениеЗаполнено(ПараметрКоманды.Основание.Грузополучатель) Тогда
			ОбластьМакета.Параметры.ПредставлениеГрузополучателя  = "Грузополучатель и его адрес: "
				+ ПараметрКоманды.Основание.Грузополучатель;
		Иначе
			ОбластьМакета.Параметры.ПредставлениеГрузополучателя  = "Грузополучатель и его адрес: "
				+ ПараметрКоманды.Основание.Контрагент.НаименованиеПолное + " "
				+ ПараметрКоманды.Основание.Контрагент.ЮридическийАдрес;
		КонецЕсли;
		Строка_ПоДокументу = "К платежно-расчетному документу №_______________от__________";
		ОбластьМакета.Параметры.ПоДокументу                   = Строка_ПоДокументу;
		ОбластьМакета.Параметры.ПредставлениеПокупателя       = "Покупатель: "
			+ ПараметрКоманды.Контрагент.НаименованиеПолное;
		ОбластьМакета.Параметры.АдресПокупателя               = "Адрес: " + ПараметрКоманды.Контрагент.ЮридическийАдрес;
		ОбластьМакета.Параметры.ИННПокупателя                 = "ИНН/КПП покупателя: " + ПараметрКоманды.Контрагент.ИНН
			+ "/" + ПараметрКоманды.Контрагент.КПП;
	КонецЕсли;
	
//	Если СчетФактура534 Тогда 
//		Попытка
//			ОбластьМакета.Параметры.ДокументыОбОтгрузке = "пп "+ПараметрКоманды.Основание.Товары.Количество()+" № "+ПараметрКоманды.Основание.Номер+" от "+Формат(ПараметрКоманды.Основание.Дата, "ДФ='дд ММММ гггг'")+ " г.";
//		Исключение
//			ОбластьМакета.Параметры.ДокументыОбОтгрузке = "";	
//		КонецПопытки;
//	КонецЕсли;

	ТабДок.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("ЗаголовокТаблицы");	
	ТабДок.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Строка");

	ИтогоСуммаНДС = 0;
	ИтогоВсего    = 0;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументОснование", ПараметрКоманды.Основание);

	Запрос.Текст =
	 "ВЫБРАТЬ
	 |	АктТовары.Ссылка.Организация,
	 |	АктТовары.Ссылка.Организация КАК Поставщик,
	 |	АктТовары.Ссылка.Контрагент КАК Покупатель,
	 |	АктТовары.Ссылка.СуммаДокумента КАК Сумма,
	 |	АктТовары.Номенклатура КАК Товар,
	 |	СУММА(АктТовары.Количество) КАК Количество,
	 |	АктТовары.Цена,
	 |	АктТовары.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	 |	СУММА(АктТовары.Сумма) КАК Стоимость,
	 |	СУММА(АктТовары.СуммаНДС) КАК СуммаНДС,
	 |	СУММА(АктТовары.Всего) КАК Всего,
	 |	АктТовары.НДС КАК СтавкаНДС,
	 |	""--"" КАК СтранаПроисхожденияКод,
	 |	""--"" КАК ПредставлениеСтраны,
	 |	""--"" КАК ПредставлениеГТД,
	 |	ВЫРАЗИТЬ(АктТовары.Номенклатура.Наименование КАК СТРОКА(1000)) КАК ТоварНаименование
	 |ИЗ
	 |	Документ.Акт.Товары КАК АктТовары
	 |ГДЕ
	 |	АктТовары.Ссылка = &ДокументОснование
	 |
	 |СГРУППИРОВАТЬ ПО
	 |	АктТовары.Цена,
	 |	АктТовары.Ссылка.Организация,
	 |	АктТовары.Ссылка.Контрагент,
	 |	АктТовары.Ссылка.СуммаДокумента,
	 |	АктТовары.Номенклатура,
	 |	АктТовары.Номенклатура.ЕдиницаИзмерения,
	 |	АктТовары.НДС,
	 |	ВЫРАЗИТЬ(АктТовары.Номенклатура.Наименование КАК СТРОКА(1000)),
	 |	АктТовары.Ссылка.Организация";
	 
	ВыборкаСтрокТовары = Запрос.Выполнить().Выбрать();
	
	ИтогоСуммаНДС = 0;
	ИтогоВсего    = 0;

	Пока ВыборкаСтрокТовары.Следующий() Цикл
		ОбластьМакета.Параметры.Заполнить(ВыборкаСтрокТовары);
		
		ИтогоСуммаНДС = ИтогоСуммаНДС + ВыборкаСтрокТовары.СуммаНДС;
		ИтогоВсего    = ИтогоВсего    + ВыборкаСтрокТовары.Всего;
      ТабДок.Вывести(ОбластьМакета);
	КонецЦикла;
   
	ОбластьМакета = Макет.ПолучитьОбласть("Итого");
	ОбластьМакета.Параметры.ИтогоСуммаНДС = ИтогоСуммаНДС;
	ОбластьМакета.Параметры.ИтогоВсего    = ИтогоВСего;
	ОбластьМакета.Параметры.ИтогоСтоимость= ПараметрКоманды.Основание.Товары.Итог("Сумма");
	ТабДок.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
	Если СчетФактура534 Тогда
		ОбластьМакета.Параметры.ФИОРуководителя 		= "/"+ПолучениеСписков.ОтвественныхЛиц(ПараметрКоманды.Организация,Перечисления.ОтветственныеЛица.Руководитель,ПараметрКоманды.Дата).ФизическоеЛицо+"/";
		ОбластьМакета.Параметры.ФИОГлавногоБухгалтера	= "/"+ПолучениеСписков.ОтвественныхЛиц(ПараметрКоманды.Организация,Перечисления.ОтветственныеЛица.ГлавныйБухгалтер,ПараметрКоманды.Дата).ФизическоеЛицо+"/";	
	иначе	
		ОбластьМакета.Параметры.ФИОРуководитель = "/"+ПолучениеСписков.ОтвественныхЛиц(ПараметрКоманды.Организация,Перечисления.ОтветственныеЛица.Руководитель,ПараметрКоманды.Дата).ФизическоеЛицо+"/";
		ОбластьМакета.Параметры.ФИОглБухгалтер	= "/"+ПолучениеСписков.ОтвественныхЛиц(ПараметрКоманды.Организация,Перечисления.ОтветственныеЛица.ГлавныйБухгалтер,ПараметрКоманды.Дата).ФизическоеЛицо+"/";
	КонецЕсли;
	ТабДок.Вывести(ОбластьМакета);
	
КонецПроцедуры
